lfazio/rv32cortex-m/src/platform/stm32f746/main.c
/* ------------------------------------------------------------------ */
/* Real interrupt lines                                                */
/* ------------------------------------------------------------------ */

/*
 * Bridging the NVIC to the APLIC.
 *
 * An interrupt is the one thing the passthrough window cannot carry. A
 * guest driver reaches a peripheral by using its address, but when that
 * peripheral raises an interrupt the NVIC vectors here, into the emulator,
 * with the guest nowhere in sight.
 *
 * The handshake is forced by one fact: nothing on this side can service the
 * device. Only the guest's driver knows how, and it will not run until the
 * emulator returns from the ISR. A level-triggered peripheral therefore
 * re-asserts the moment the handler exits, and the emulator would spin in
 * interrupt entry forever without the guest ever making progress. So the
 * line is masked on entry and stays masked until the guest clears the
 * APLIC pending bit, which is its way of saying the device has been dealt
 * with -- see emu_board_irq_unmask, reached through the APLIC's eoi hook.
 *
 * Adding a peripheral is one table entry and one handler; the table is the
 * policy, the same way g_periph_map is for addresses.
 */
/*
 * An APLIC source number *is* the NVIC line number, so there is no mapping
 * table -- and, more to the point, none in the guest either. A driver that
 * would call HAL_NVIC_EnableIRQ(TIM6_DAC_IRQn) writes that same 54 to the
 * APLIC's setienum, and the two numbering spaces never have to be
 * reconciled. It is the reason RV_APLIC_SOURCES is 128 rather than 32.
 */
static const IRQn_Type g_bridged[] = {
    TIM6_DAC_IRQn,
};

static bool irq_is_bridged(uint32_t source)
{
    for (unsigned i = 0; i < sizeof(g_bridged) / sizeof(g_bridged[0]); i++) {
        if ((uint32_t)g_bridged[i] == source) {
            return true;
        }
    }
    return false;
}

static void irq_line_entry(IRQn_Type irqn)
{
    NVIC_DisableIRQ(irqn);
    emu_core_set_irq(&g_core, (uint32_t)irqn, true);
}

void emu_board_irq_unmask(void *ctx, uint32_t source)
{
    (void)ctx;
    if (irq_is_bridged(source)) {
        NVIC_ClearPendingIRQ((IRQn_Type)source);
        NVIC_EnableIRQ((IRQn_Type)source);
    }
}

/*
 * Enable the bridged lines at the NVIC. Priority is left at the default:
 * these handlers do almost nothing, and the emulator has no other interrupt
 * to rank them against.
 */
void emu_board_irqs_init(void)
{
    for (unsigned i = 0; i < sizeof(g_bridged) / sizeof(g_bridged[0]); i++) {
        NVIC_EnableIRQ(g_bridged[i]);
    }
}

void TIM6_DAC_IRQHandler(void)
{
    irq_line_entry(TIM6_DAC_IRQn);
}

/*
 * Where the guest image currently lives. Initialised to the copy
 * guest_image.S baked into the firmware, and repointed at the flash
 * arena when one arrives over TFTP.
 *
 * These exist because build_address_space() used to read the .incbin
 * symbols directly, which made "which image is running" a link-time
 * fact. An upload has to be able to change it at run time.
 */
static const uint8_t *g_img      = emu_guest_image;
static uint32_t       g_img_size;
static uint32_t       g_img_ro;
static bool start_guest(void);

/* ------------------------------------------------------------------ */
/* What this board owes the shared runner (see emu_board.h)            */
/* ------------------------------------------------------------------ */

/*
 * Guest time, from the cycle counter. The divisor is fixed at start-up
 * because SystemCoreClock is, and the epoch is the first slice rather
 * than reset so a guest's clock starts near zero.
 */
static uint32_t g_cycles_per_tick;
static uint32_t g_start_cycles;

uint64_t emu_board_time_now(void)
{
    return (uint64_t)(board_cycles() - g_start_cycles) / g_cycles_per_tick;
}

const char *const emu_board_core_name = "Cortex-M7";

/*
 * Mutable, because this board *can* be reloaded: an image arriving over
 * TFTP or through gdb's `load` moves these, and the address space is
 * rebuilt around the new numbers.
 */
const uint8_t *emu_board_img      = NULL;
uint32_t       emu_board_img_size = 0u;

uint8_t *emu_board_ram      = NULL;
uint32_t emu_board_ram_size = 0u;

/*
 * The passthrough windows. Identity-mapped, so a guest driver writing
 * what its datasheet says reaches the real peripheral -- the point of
 * this emulator, and necessarily per-part.
 */
bool emu_board_add_regions(emu_bus_t *bus)
{
    for (unsigned i = 0; i < sizeof(g_periph_map) / sizeof(g_periph_map[0]);
         i++) {
        if (!emu_bus_add_passthru(bus, g_periph_map[i].name,
                                  g_periph_map[i].base,
                                  g_periph_map[i].size,
                                  (uintptr_t)g_periph_map[i].base,
                                  g_periph_map[i].perm, EMU_WANY)) {
            return false;
        }
    }
    return true;
}

/* The board's view of the image, refreshed before every rebuild. */
static void publish_image(void)
{
    emu_board_img      = g_img;
    emu_board_img_size = g_img_size;
    emu_board_ram      = GUEST_RAM_BASE_PTR;
    emu_board_ram_size = GUEST_RAM_SIZE;
}


/*
 * Everything that has to be redone when the guest image changes:
 * rebuild the bus from the image's two halves, put the writable half
 * where the guest expects it, and reset the core.
 *
 * Split out of main() because an upload has to repeat it. The address
 * space is torn down and rebuilt rather than patched, because the
 * read-only region's base and length both move when a different image
 * arrives and emu_bus has no way to resize a region in place.
 */
void emu_board_image_published(void)
{
#if EMU_GUEST_ARCH_G4MH
    /* This frontend executes from code flash, so it has to be told where
     * the image now is; the RV32 side reads it through the bus. */
    g4mh_set_flash(emu_board_img, emu_board_img_size, false);
#endif
}

static bool start_guest(void)
{
    publish_image();
    return emu_start_guest(&g_core, &g_bus, &g_uart, &g_exit);
}

