lfazio/rv32cortex-m/src/platform/stm32f746/main.c
#if EMU_NET
/* ------------------------------------------------------------------ */
/* Images arriving over TFTP                                           */
/* ------------------------------------------------------------------ */

/*
 * The emulator is already suspended whenever these run: they are reached
 * from emu_net_poll(), which the run loop calls between guest slices, so
 * no guest instruction is in flight. Nothing has to be stopped -- but
 * the restart does have to be explicit, because the bus regions and the
 * reset vector were built from the old image.
 */
/*
 * Both halves land in the flash arena, back to back, and the guest is
 * restarted only when the second arrives.
 *
 * The writable half cannot go straight into guest RAM, which is the
 * obvious thing and is wrong: start_guest() clears RAM beyond the image
 * -- deliberately, so that one test cannot pass on state another wrote
 * -- and it is start_guest() that the upload calls. The .data written
 * during the transfer was being zeroed by the reload it triggered.
 * Nothing would have reported it: the check is "did the guest run", and
 * it does, with every initialised variable set to zero. Two of the three
 * guests in the tree have an empty .rw, so the obvious thing to test it
 * with cannot see it either.
 *
 * Keeping both halves in flash also makes the arrangement identical to
 * the baked-in image -- one blob, split at g_img_ro -- so start_guest()
 * needs no case for where the image came from, and a reset re-runs the
 * uploaded guest rather than reverting to the built-in one.
 *
 * Hence the contract: upload `rom`, then `ram`. The ram half is the
 * commit point, because it is the one that completes an image; a guest
 * with no .data uploads an empty one to say so. Committing on the rom
 * half instead would restart the guest with the *previous* image's
 * .data, print a whole run's worth of output from it, and only then be
 * corrected -- and a harness reading the console cannot tell that first
 * summary from the real one.
 */
static uint32_t g_up_addr;      /* where the rom half is being written  */
static uint32_t g_up_ro;        /* bytes of the rom half received       */
static bool     g_up_have_ro;   /* ... and that one arrived, even if empty */
static uint32_t g_up_rw;        /* bytes of the ram half received       */
static bool     g_reload;

bool emu_net_image_begin(emu_net_image_t which)
{
    if (which == EMU_NET_IMAGE_ROM) {
        g_up_addr = board_flash_arena_begin();
        g_up_ro = 0u;
        g_up_have_ro = false;
        return g_up_addr != 0u;
    }
    /*
     * The ram half is appended to the rom half, so it needs one to have
     * arrived. Refusing here is what stops a lone `ram` upload from
     * committing whatever the arena happened to hold.
     *
     * Tracked as a flag rather than by g_up_ro being non-zero, because
     * an empty rom half is legitimate: an image whose layout has no
     * read-only prefix -- a flat binary, where nothing says where .data
     * begins -- is uploaded as zero bytes of rom and all of it as ram.
     * Testing the length would refuse exactly that case.
     */
    if (g_up_addr == 0u || !g_up_have_ro) {
        return false;
    }
    g_up_rw = 0u;
    return true;
}

bool emu_net_image_data(emu_net_image_t which, const void *data,
                        uint32_t len, uint32_t off)
{
    if (which == EMU_NET_IMAGE_ROM) {
        const bool ok = board_flash_write(g_up_addr + off, data, len);

        /*
         * Say which step refused and what the HAL made of it. TFTP's
         * "error writing file" reaches the client with no detail, and
         * on this side "upload failed" alone cannot distinguish a full
         * arena -- the expected failure, which erasing recovers -- from
         * a program the peripheral rejected, which retrying never will.
         */
        if (!ok) {
            console_puts("\nemu: rom write failed addr=");
            console_puthex(g_up_addr + off);
            console_puts(" len=");
            console_putu(len);
            console_puts(" halerr=");
            console_puthex(board_flash_last_error());
            console_puts("\n");
        }
        return ok;
    }

    /*
     * Appended after the rom half, so that the two are contiguous and
     * g_img_ro splits them exactly as it does for the baked-in image.
     *
     * Bounds-checked against guest RAM rather than trusted, even though
     * it is landing in flash: this is what will be copied into RAM at
     * every reset, and a TFTP client is the other end of a wire.
     */
    if ((off + len) > GUEST_RAM_SIZE) {
        return false;
    }
    return board_flash_write(g_up_addr + g_up_ro + off, data, len);
}

void emu_net_image_end(emu_net_image_t which, uint32_t len, bool ok)
{
    if (!ok) {
        /*
         * Nothing is committed, so a failed upload leaves the board
         * exactly as it was and the previous guest is still the one
         * that would run. The flash written so far is simply not
         * claimed; the next begin() hands out the same address again.
         *
         * The arena filling up is the expected failure, not an
         * exceptional one -- there is no length in a TFTP request, so
         * running out is how the end is discovered. Erasing here means
         * the client's retry succeeds rather than failing identically.
         *
         * Both halves, and the ram half is the one that matters. The
         * client sends rom then ram, so the transfer that runs off the
         * end of the arena is almost always the *second* one: the rom
         * half still fits at the address begin() handed out. Erasing on
         * the rom half alone therefore recovered from the case that
         * rarely happens and not from the one that does -- every retry
         * re-sent a rom half that fitted and a ram half that did not,
         * failing identically for ever. The board needed a power cycle
         * to take another image, which reads as a dead server rather
         * than a full one.
         */
        (void)board_flash_arena_reset();
        g_up_addr = 0u;
        g_up_ro = 0u;
        g_up_rw = 0u;
        g_up_have_ro = false;
        console_puts("\nemu: upload failed\n");
        return;
    }

    if (which == EMU_NET_IMAGE_ROM) {
        /*
         * Recorded, not committed. The image is not complete until the
         * ram half arrives, and committing here would both publish a
         * ROM window over flash the ram half is about to occupy and
         * restart the guest against the previous image's .data.
         */
        g_up_ro = len;
        g_up_have_ro = true;
        return;
    }

