lfazio/rv32cortex-m/src/platform/stm32f746/main.c
    /*
     * The bus only, at this point: emu_core_open() needs one to open
     * onto, and the devices, reset and boot come later through
     * start_guest() -- which needs the core to exist.
     */
    /*
     * The whole bring-up, not just the bus: a new image needs the
     * frontend's devices re-added, RAM cleared and the core reset, and
     * skipping that leaves the previous guest's core state in place --
     * which presents as the new guest retiring zero instructions.
     */
    if (!start_guest()) {
        console_puts("emu: uploaded image does not fit guest RAM\n");
        return false;
    }

    console_printf("\nemu: running uploaded image, %u ro + %u rw bytes\n",
                   (unsigned)g_img_ro, (unsigned)g_up_rw);
    return true;
}
#endif

/* ------------------------------------------------------------------ */
/* Diagnostics                                                         */
/* ------------------------------------------------------------------ */



/* ------------------------------------------------------------------ */
/* Entry                                                               */
/* ------------------------------------------------------------------ */

int main(void)
{
    board_init();

#if RV32_NATIVE_COREMARK
    /*
     * Native baseline: the same CoreMark sources compiled for Cortex-M7
     * and run directly, with no emulation, so the interpreter and JIT
     * numbers can be put against something absolute.
     */
    {
        extern int coremark_native_main(void);
        console_printf("\n\nrv32cortex-m: NATIVE CoreMark on %s @ %u MHz\n\n",
                       emu_board_core_name,
                       (unsigned)(SystemCoreClock / 1000000u));
        const uint32_t c0 = board_cycles();
        (void)coremark_native_main();
        console_printf("\n-- native --\n  host     %u cycles\n",
                       (unsigned)(board_cycles() - c0));
        for (;;) { __WFI(); }
    }
#endif
    /*
     * The frontend names itself, and builds its ISA string from the
     * extensions actually compiled in, so the banner cannot drift from what
     * the core implements -- which it could when this file spelled the
     * string out itself.
     */
    const emu_cpu_ops_t *const ops = emu_frontend_default();

    console_printf("\n\nrv32cortex-m: %s on %s @ %u MHz\n",
                   ops->desc, emu_board_core_name,
                   (unsigned)(SystemCoreClock / 1000000u));

#if EMU_NET
    /*
     * The handover happens here, before the rest of the banner, so that
     * everything describing what is about to run -- guest size, guest
     * RAM, which backend came up -- reaches a telnet client rather than
     * a serial port nobody is watching. It is buffered until one
     * connects, which is what net_telnet.c's output ring is for.
     *
     * The two lines below are the last thing the UART ever carries as
     * text, and they are deliberately the two that matter when nothing
     * works: whether the stack started at all, and what address to
     * connect to. After this, silence on the serial port is expected and
     * silence on the network is the fault.
     */
    console_printf("net    %s on this port; telnet %s 23\n",
                   EMU_NET_LINK_PPP ? "PPP" : "SLIP", emu_net_addr_str());
    if (!emu_net_init()) {
        console_puts("net    failed to start; staying on the serial console\n");
    }
#endif

    /*
     * Which image is running, before anything asks. build_address_space()
     * reads these rather than the .incbin symbols -- that is what lets an
     * upload replace the image at run time -- so leaving them until after
     * the bus is built publishes a zero-length ROM region, which the bus
     * rejects, and the firmware halts before it has run an instruction.
     */
    g_img_size = emu_guest_image_size;
    g_img_ro   = emu_guest_ro_size;

    /*
     * The bus only here: emu_core_open() needs one to open onto, and the
     * devices, reset and boot come later through start_guest(), which
     * needs the core to exist.
     */
    publish_image();
    if (!emu_build_address_space(&g_bus, &g_uart)) {
        console_puts("fatal: could not build the guest address space\n");
        fatal_halt();
    }

    if (!emu_core_open(&g_core, ops, &g_bus, 0u)) {
        console_puts("fatal: frontend has no core 0\n");
        fatal_halt();
    }

    ops->set_unmask_hook(g_core.cpu, emu_board_irq_unmask, NULL);
    emu_board_irqs_init();
    emu_uart_init(&g_uart, emu_console_uart_tx, guest_uart_rx, NULL);
    ops->set_syscall(g_core.cpu, emu_guest_syscall, &g_sc_ctx);
    ops->set_cache(g_core.cpu, &emu_arm_cache_ops);

#if EMU_NET
    /*
     * The gdb stub, once there is a core for it to describe. Started
     * after the guest exists and before it runs, so a debugger that
     * connects immediately finds the guest at its reset vector rather
     * than somewhere arbitrary.
     *
     * Failure is not fatal: a board that cannot serve gdb is still a
     * board that runs guests, and saying so beats halting.
     */
    {
        /*
         * Which description depends on the frontend built in, not on the
         * platform: gdb's `g` packet is a fixed per-architecture
         * concatenation and gdb does not ask, so serving the RV32 layout
         * for a G4MH guest gives an `info registers` that is entirely
         * wrong and entirely plausible.
         */
#if EMU_GUEST_ARCH_RV32
        extern const emu_gdb_target_t *rv32_gdb_target(void);
        const emu_gdb_target_t *gt = rv32_gdb_target();
#else
        extern const emu_gdb_target_t *g4mh_gdb_target(void);
        const emu_gdb_target_t *gt = g4mh_gdb_target();
#endif

        if (!emu_net_gdb_init(&g_core, gt, &k_gdb_flash)) {
            console_puts("gdb    stub failed to start\n");
        } else {
            console_puts("gdb    target remote ");
            console_puts(emu_net_addr_str());
            console_puts(":1234\n");
        }
    }
#endif

