lfazio/rv32cortex-m/src/platform/stm32f746/main.c
    /*
     * Now that there is a core to hang them off, put the frontend's own
     * devices on the bus and start. start_guest() does both, because a
     * reload has to do both -- see the note on it.
     */
    if (!start_guest()) {
        console_puts("fatal: could not start the guest\n");
        fatal_halt();
    }

    /*
     * Everything from here down is one run of one guest, and an uploaded
     * image comes back to it. The banner is inside the loop deliberately:
     * it names the image's size, which is the first thing that differs
     * after a reload and the first thing a harness wants to see.
     */
restart:
    console_printf("guest  %u bytes at 0x%08x\n"
                   "ram    %u KiB (%u bytes)\nbackend ",
                   (unsigned)g_img_size, (unsigned)EMU_GUEST_RESET_PC,
                   (unsigned)(GUEST_RAM_SIZE / 1024u),
                   (unsigned)GUEST_RAM_SIZE);

    emu_cpu_status_t st;
    emu_core_status(&g_core, &st);
    console_printf("%s\n\n", st.backend);

    g_cycles_per_tick = SystemCoreClock / EMU_TIMER_HZ;
    const uint32_t start_cycles = board_cycles();

    g_start_cycles = start_cycles;
    uint64_t retired_total = 0;

    bool capped = false;

    {
        const emu_run_env_t env = {
            .slice       = EMU_RUN_SLICE,
            .max_insn    = EMU_MAX_INSN,
#if EMU_NET
            .take_upload = take_uploaded_image,
#else
            .take_upload = NULL,
#endif
        };
        const emu_run_outcome_t out =
            emu_run_guest(&g_core, ops, &env, &retired_total);

        if (out == EMU_RUN_OUTCOME_RELOAD) {
            goto restart;
        }
        capped = (out == EMU_RUN_OUTCOME_CAPPED);
    }

    const uint32_t elapsed = board_cycles() - start_cycles;

    if (capped) {
        /*
         * Named on its own line and before the statistics, so a harness
         * reading the console can tell "did not terminate" from "ran and
         * failed" without parsing the numbers.
         */
        console_puts("\nemu: instruction cap reached, guest did not halt\n");
    }

    emu_print_run_summary(retired_total, elapsed);
    if (retired_total != 0u) {
        /* KIPS needs the core clock, which is the platform's to know. */
        const uint32_t kips =
            (uint32_t)((uint64_t)retired_total * (SystemCoreClock / 1000u) / elapsed);
        console_printf("  speed    %u KIPS\n", (unsigned)kips);
    }

/*
 * JIT statistics.
 *
 * **These are the framework's, not a frontend's**, and this used to say
 * the opposite -- "the one place in this file that names a frontend, and
 * unavoidably so". It was avoidable: `emu_jit_get_stats` reports blocks,
 * translations, entries, fallbacks, flushes, compactions, evictions,
 * code use and the declined/overflow split for *any* frontend on *any*
 * host, because the dispatch loop that maintains them is shared. Reading
 * them through rv_jit_get_stats meant a G4MH firmware -- which has a
 * Thumb-2 JIT and uses it -- printed no statistics at all, so the one
 * number that says whether translation is being exercised was missing
 * from exactly the frontend with no reference model to fall back on.
 *
 * `code_size` is the test for "there is a JIT here": the framework only
 * has a buffer once a backend initialised one, and it is zero on an
 * interpreter build without needing to name a backend.
 */
#if EMU_HAVE_JIT
    (void)emu_print_jit_stats();
#endif

#if EMU_GUEST_ARCH_RV32 && EMU_HAVE_JIT
    /*
     * The rest are the RV32 backend's own counters and have no framework
     * equivalent: which helper calls it emitted, whether the passthrough
     * window was armed, and how often a block reads the registers a
     * per-block cache would hold.
     */
    if (rv_backend == &rv_backend_jit) {
        rv_jit_stats_t rs;

        rv_jit_get_stats(&rs);
        console_printf(
            "  helpers  muldiv %u  clmul %u  bit %u\n"
            "  pt hits  %u armed %u\n",
            (unsigned)rs.alu_calls_muldiv, (unsigned)rs.alu_calls_clmul,
            (unsigned)rs.alu_calls_bit,
            (unsigned)rs.pt_hits, (unsigned)rs.pt_armed);
#ifdef EMU_JIT_PROFILE
        console_printf("  cyc xlat %u compact %u\n",
                       (unsigned)rs.cyc_translate, (unsigned)rs.cyc_compact);
#endif
        /*
         * Reads per block that uses the register, x100. Below 100 a
         * cache cannot pay: the block would spend a load to save fewer
         * than one.
         */
        {
            static const char *const nm[4] = { "sp", "ra", "a0", "a1" };

            console_printf("  reads/blk");
            for (unsigned i = 0; i < 4u; i++) {
                if (rs.hot_blocks[i] != 0u) {
                    const uint32_t x100 =
                        rs.hot_reads[i] * 100u / rs.hot_blocks[i];
                    console_printf(" %s=%u.%02u in %u", nm[i],
                                   (unsigned)(x100 / 100u),
                                   (unsigned)(x100 % 100u),
                                   (unsigned)rs.hot_blocks[i]);
                } else {
                    console_printf(" %s=- in %u", nm[i],
                                   (unsigned)rs.hot_blocks[i]);
                }
            }
            console_printf("\n");
        }
    }
#endif

    emu_report_state(g_core.cpu, g_core.ops);

#if EMU_NET
    /*
     * Bytes the wire delivered and nothing collected. Reported next to
     * the guest's own numbers because it is the one failure that makes
     * *those* numbers untrustworthy without looking wrong: a dropped
     * byte is a dropped SLIP frame, which is a retransmission at best
     * and a truncated image at worst.
     */
    console_puts("\n-- net --\n  rx drops ");
    console_putu(board_console_rx_overruns());
    /*
     * How often the TFTP server had to be rebuilt under it. Nonzero is
     * normal -- the watchdog re-arms while the link is quiet -- but it
     * climbing during a suite run means transfers are being abandoned,
     * which is worth seeing rather than inferring from a slow harness.
     */
    console_puts("  tftp reclaims ");
    console_putu(emu_net_tftp_reclaims());
    console_putc('\n');
#endif

