lfazio/rv32cortex-m/src/platform/stm32f746/main.c
    /*
     * The machine-readable terminator, and deliberately the last thing
     * printed for a run.
     *
     * A harness needs two things this report otherwise does not give it:
     * where the output for this guest *ends* -- there is no process to
     * exit, so nothing else says so -- and the guest's exit status,
     * which both test suites judge on and which was being captured and
     * then thrown away. run-riscv-tests.sh reads the runner's exit code
     * as (testnum << 1) | 1, so losing it means every result is "it ran".
     *
     * `exited` distinguishes a guest that called exit() from one that
     * halted or was capped, because exit=0 means nothing if the guest
     * never reached the syscall.
     */
    console_puts("\nemu-result exit=");
    console_putu(g_exit.code);
    console_puts(" exited=");
    console_putu(g_exit.exited ? 1u : 0u);
    console_puts(" capped=");
    console_putu(capped ? 1u : 0u);
    console_puts(" retired=");
    console_putu((uint32_t)retired_total);
    console_putc('\n');

    for (;;) {
#if EMU_NET
        /*
         * Everything above is still sitting in the output ring: the run
         * loop stopped, and with it the only thing that was delivering.
         * Parking in __WFI without draining first would lose the entire
         * report -- which is the part a harness came for.
         *
         * __WFI is still right rather than a busy loop. The UART receive
         * interrupt is what wakes it, and that fires on the first byte
         * of anything the host sends, including the ACK for what is
         * being flushed here.
         */
        emu_net_poll();

        /*
         * An image may arrive after the guest has finished, and that is
         * the *normal* case rather than an edge one: a harness runs a
         * test, waits for it to halt and report, then pushes the next.
         * The reload check inside the run loop above never sees those,
         * because that loop exited when the guest halted -- so an upload
         * completed successfully, said so, and nothing happened.
         *
         * Jumping back to the top of the run is what makes the board a
         * server for the whole suite instead of a one-shot. `goto`
         * rather than wrapping the run in a function: everything it
         * needs is already local to main(), and a loop around all of it
         * would indent the entire body to say the same thing.
         */
        if (take_uploaded_image()) {
            goto restart;
        }

        /*
         * Run control still works after the guest has finished.
         *
         * Without this the park loop services the network and nothing
         * else, so a debugger attaching to a completed run can read
         * registers and memory and then hangs the moment it resumes:
         * `continue` is accepted, nothing executes, and gdb waits
         * forever. That is the normal way to arrive here -- push an
         * image, watch it fail, attach to find out why -- and being
         * able to rewind the pc and re-run under a breakpoint is most
         * of what that is for.
         *
         * __WFI is skipped while a debugger is driving, because the
         * thing that would wake it is the guest's own interrupt and
         * there may not be one.
         */
        if (emu_net_gdb_attached()) {
            uint32_t n = 0;

            (void)emu_net_gdb_run(EMU_RUN_SLICE, &n);
            continue;
        }

        /*
         * Do not sleep while the stack is up, and the reason is the
         * clock rather than latency.
         *
         * lwIP's time base is sys_now(), which is derived from
         * board_cycles() -- DWT CYCCNT, a counter of *processor* cycles.
         * __WFI stops the processor clock, so CYCCNT stops with it and
         * the stack's notion of time stops advancing. Measured here:
         * over 29 seconds of wall time parked in this loop, lwIP's clock
         * advanced 1.74 seconds, about 6% of real time.
         *
         * Every timeout in the stack is frozen by that, not just one.
         * The visible symptom was TFTP: a client killed mid-transfer
         * leaves a session open, and the 10-second timeout that would
         * reclaim it needs ~3 minutes of wall time to expire, so in
         * practice the board refused every later upload until it was
         * reset. Anything else time-based -- a TCP retransmission, an
         * ARP entry ageing out -- is slowed by the same factor, and
         * would present as a link that is mysteriously sluggish rather
         * than as a stopped clock.
         *
         * Nothing here is a power-sensitive workload: this loop is a
         * bench board waiting to be handed the next test image. Polling
         * costs nothing that matters and keeps the clock honest. The
         * board still sleeps when the network is *not* up, which is the
         * plain serial-console case where nothing depends on lwIP's
         * timers at all.
         *
         * Fixing it in the time base instead would mean a free-running
         * peripheral timer -- a TIM keeps its clock through Sleep where
         * CYCCNT does not -- which is the better answer if this loop
         * ever needs to sleep again.
         */
        if (emu_net_active()) {
            continue;
        }
#endif
        __WFI();
    }
}
